<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class DistrictSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $data = [
            '5 школа',
            '12 школа',
            '18 школа',
            '28 школа',
            'Автовокзал',
            'Автодром',
            'Авторинок',
            'Агропереробка',
            'Бармаки',
            'Басів Кут',
            'Біла Криниця',
            'Боярка',
            'Бруклін',
            'Бурштин',
            'Вересневе',
            'Відінська',
            'Газовик',
            'Гідропарк',
            'Грабник',
            'Дворецька',
            'Дружба',
            'Екватор',
            'Епіцентр',
            'Ж-Д вокзал',
            'Золотіїв',
            'Зоопарк',
            'Істанбул',
            'Колоденка',
            'Костромська',
            'Курчатова',
            'Лінії',
            'Луцьке кільце',
            'Льонокомбінат',
            'Марлен',
            'Масив Багряний',
            'Масив Криниченьк',
            'Масив Макарова',
            'Масив Ясеневий',
            'Мелроуз',
            'Мірющенка',
            'Мілан',
            'Молодіжне',
            'Мототрек',
            'Млинівська',
            'Новий Двір',
            'Обарів',
            'Обласна лікарня',
            'Пивзавод',
            'Північний',
            'Підкова',
            'ПМК-100',
            'Покровський',
            'Радіозавод',
            'Райський Сад',
            'РДГУ',
            'РЗВА',
            'Ремзавод',
            'Рівнеенерго',
            'РУМ',
            'Текстильник',
            'Тинне',
            'Царське Село',
            'Центр',
            'Чайка',
            'Червоні Гори',
            'Холм Слави',
            'Шпанів',
            'Щасливе',
            'Ювілейний',
        ];

        $city = db::table('cities')->where('title', 'Рівне')->first();

        if (!$city) {
            $cityId = db::table('cities')->insertGetId([
                'title' => 'Рівне',
            ]);
        } else {
            $cityId = $city->id;
        }

        foreach ($data as $k => $v) {
            $item = db::table('districts')->where('title', $v)->first();

            if (!$item) {
                db::table('districts')->insert([
                    'title' => $v,
                    'city_id' => $cityId,
                    'order' => $k,
                ]);
            }
        }
    }
}
